{
  "Eye-Hand Coordination Game": {
    "filename": "eye_hand_coordination_game.mp4",
    "video_description": "Cartoon child plays a fun catch-the-ball game with parent in a garden, tracking and catching a bouncing colorful ball — showing exaggerated joyful eye tracking."
  },
  "Focus Training Ball Bouncing Game": {
    "filename": "focus_training_game.mp4",
    "video_description": "Animated child stares at a bouncing ball shifting distances, switching focus between ball and distant tree with superhero sparkles in the eyes each time focus shifts."
  },
  "Mirror Blink Race Exercise": {
    "filename": "mirror_blink_game.mp4",
    "video_description": "Child races cartoon self in mirror to blink fast with every time a bell sounds — boosts blink rate and eye moisture regulation."
  },
  "Eye Strain Relief Massage Exercise": {
    "filename": "eye_strain_relief.mp4",
    "video_description": "Playful animation of child gently massaging around their eyes with fingers in circular motion, while relaxing clouds and soft sparkles float around."
  },
  "Palming Relaxation Exercise": {
    "filename": "palming_relaxation.mp4",
    "video_description": "Cartoon child sitting cross-legged with eyes closed, covering eyes gently with palms as peaceful forest scene fades in, showing sparkles of calm around eyes."
  },
  "Near-Far Focus Switch Exercise": {
    "filename": "near_far_focus.mp4",
    "video_description": "Animated child switches gaze between a pencil held in front and a tree outside the window — glowing focus beams show eyes adjusting between near and far objects."
  },
  "Astigmatism Tracking Movement Exercise": {
    "filename": "tracking_movement_exercise.mp4",
    "video_description": "Cartoon child follows a flying butterfly that moves in horizontal and vertical paths, with glowing eye beams tracing the path — head stays still, only eyes move."
  },
  "Sunlight Play Task Game": {
    "filename": "sunlight_play_task.mp4",
    "video_description": "Cartoon kids play tag and ball in a sunny park, eyes glowing as they move around in natural daylight — the sun winks happily as they laugh and play outdoors."
  },
  "Smooth Tracking Exercise": {
    "filename": "smooth_tracking_exercise.mp4",
    "video_description": "Animated child tracks a glowing balloon smoothly as it floats left to right, then up and down, with trail sparkles showing smooth eye movement, no jerks."
  },
  "Eye Muscle 8-Pattern Exercise": {
    "filename": "eight_pattern_exercise.mp4",
    "video_description": "Animated child traces a glowing number 8 in the air with their eyes, following it smoothly as it loops — sparkles show muscle movement paths."
  },
  "Saccadic Movement Training Exercise": {
    "filename": "saccade_training_game.mp4",
    "video_description": "Cartoon shows how to tape two colorful animal pictures or emojis on opposite walls — child stands in the middle and shifts gaze quickly left and right when they hear a sound or clap — builds saccadic eye movement through real-space cues."
  },
  "Peripheral Awareness Exercise": {
    "filename": "peripheral_awareness_game.mp4",
    "video_description": "A cartoon child notices and reaches for objects appearing from the edges of the screen, training peripheral vision with playful music and vibrant animations."
  },
  "Focus Switch Objects Exercise": {
    "filename": "focus_switch_objects.mp4",
    "video_description": "A lively child switches focus between a spinning top close by and a flying kite far away, highlighted with focus lines and cheerful background sounds."
  },
  "Myopia Control Walk Game": {
    "filename": "myopia_control_walk.mp4",
    "video_description": "A happy animated child takes a stroll outdoors, looking around at trees, flowers, and sky to encourage natural myopia control, with bright sunny environment and playful tunes."
  },
  "Clockwise Eye Roll Exercise": {
    "filename": "clockwise_eye_roll.mp4",
    "video_description": "A cheerful animated child rolls their eyes in a slow, circular clockwise motion, with guiding arrows and sparkles to make it fun and clear."
  },
  "Anti-Clockwise Eye Roll Exercise": {
    "filename": "anticlockwise_eye_roll.mp4",
    "video_description": "An animated child rolls their eyes in an anti-clockwise circle, with colorful directional arrows and light effects to guide the motion."
  },
  "Zoom Focus Exercise": {
    "filename": "zoom_focus_exercise.mp4",
    "video_description": "A cartoon child holds a toy and slowly brings it closer to their nose, eyes focusing in and out like a zoom lens, with sound effects and a magical sparkle trail."
  },
  "Pencil Pushup Focus Exercise": {
    "filename": "pencil_pushup_exercise.mp4",
    "video_description": "An animated child slowly moves a pencil from arm's length to nose tip, focusing their eyes all the way, with pop-up stars and playful background sounds."
  },
  "Blinking with Breathing Exercise": {
    "filename": "blinking_breathing_relaxation.mp4",
    "video_description": "A calm cartoon child takes deep breaths and blinks gently to soothing music, with soft clouds and animated heartbeats showing the rhythm."
  },
  "Diagonal Eye Tracking Exercise": {
    "filename": "diagonal_tracking_exercise.mp4",
    "video_description": "An animated child follows a star that moves diagonally across the screen, tracing its motion with just their eyes, on a vibrant night sky background."
  },
  "Thumb Near-Far Focus Exercise": {
    "filename": "thumb_focus_shift.mp4",
    "video_description": "A cartoon child focuses on their outstretched thumb, then switches gaze to a faraway tree, back and forth with fun ping sounds and smooth animation."
  },
  "Eye Stretch Up and Down Exercise": {
    "filename": "eye_stretch_up_down.mp4",
    "video_description": "A playful child moves their eyes up to a floating balloon and down to a toy on the ground, repeating with arrows and silly sound cues to keep it engaging."
  },
  "Spoon Tracking Challenge Exercise": {
    "filename": "spoon_tracking_game.mp4",
    "video_description": "Cartoon shows a parent holding a regular spoon with a colorful sticker at the tip. They move it in slow zigzag and circular paths at different distances while the child keeps their head still and tracks only with their eyes — gradually increasing speed builds smooth pursuit and focus control."
  },
  "Color Contrast Explorer Exercise": {
    "filename": "color_contrast_explorer.mp4",
    "video_description": "A cartoon child explores magical lands where animals hide in colorful scenes. Younger kids (ages 4–7) spot big, bright animals on high-contrast backgrounds, while older kids (8–15) find camouflaged creatures in trickier color blends — all guided by fun sounds and cheerful animations that improve color contrast sensitivity."
  },
  "Eye Shoulder Tag Exercise": {
    "filename": "shoulder_tap_eyes.mp4",
    "video_description": "Animated character stands still while a floating cartoon hand taps its left and right shoulders alternately. The child is guided to track the hand with only their eyes (no head movement). Each tap has a fun sound. Voiceover says: 'Eyes only — tap left, tap right!' Helps train horizontal eye movement and visual tracking."
  },
  "Fan Blade Zoom Focus Exercise": {
    "filename": "fan_blade_focus.mp4",
    "video_description": "Child switches focus between near toy and slowly spinning fan overhead — builds accommodation flexibility."
  },
  "Mirror Eye Movement Mimic Exercise": {
    "filename": "mirror_eye_mimic.mp4",
    "video_description": "A cartoon child copies the eye movements of a mirror character — up, down, side to side — in a fun, mimic-the-face challenge."
  },
  "Vertical Line Chase Exercise": {
    "filename": "vertical_chase_game.mp4",
    "video_description": "A glowing line drops from the sky and the child’s eyes chase it downward, then upward — training smooth vertical eye movement."
  },
  "Snack Time Color Hunt Game": {
    "filename": "color_snack_focus.mp4",
    "video_description": "Child sorts colorful snacks or fruit into dishes by color, following animation prompts — enhances color vision and sorting saccades."
  },
  "Shape Recognition Blink Task Exercise": {
    "filename": "shape_blink_game.mp4",
    "video_description": "Child blinks to ‘select’ the correct shape shown on screen in a fast-paced recognition game — encourages blinking and visual processing together."
  },
  "Shadow Chase Peripheral Exercise": {
    "filename": "shadow_chase_peripheral.mp4",
    "video_description": "A cartoon child tries to tap glowing shadows that appear suddenly from the edges of the screen, training fast peripheral reaction in a fun jungle scene."
  },
  "Rainbow Gaze Up-Down Exercise": {
    "filename": "rainbow_gaze_up_down.mp4",
    "video_description": "Child follows a rainbow sliding from top to bottom of the screen and back, with their eyes only — sparkles show up-down tracking clearly."
  },
  "Fruit Toss Distance Drill Exercise": {
    "filename": "fruit_toss_focus.mp4",
    "video_description": "Cartoon caregiver gently tosses fruits from a distance while child catches — trains convergence/divergence and eye-hand coordination."
  },
  "Water Bottle Tracking Exercise": {
    "filename": "water_bottle_track.mp4",
    "video_description": "Child rolls a bottle slowly across a table and follows it with their eyes — encourages object-based eye tracking indoors."
  },
  "Skyline Horizon Blink Game": {
    "filename": "skyline_blink_relax.mp4",
    "video_description": "A peaceful animation of a city skyline at sunset with child blinking slowly while watching the horizon — encourages long-distance gaze and calm blinking."
  },
  "Toy Hunt Peripheral Exercise": {
    "filename": "toy_peripheral_spotting.mp4",
    "video_description": "Animated voiceover encourages the child to stand still and look straight ahead while a family member quietly places or moves toys at the edges of their vision. The child must guess or point using only peripheral vision — no head turns. Emphasizes real-life peripheral awareness, family interaction, and attention building."
  },
  "Rainbow Rope Eye Guide Exercise": {
    "filename": "rainbow_rope_jumps.mp4",
    "video_description": "Voice-guided cartoon instructs child to jump over a colorful rope held by a family member — keeping head still and eyes focused ahead. Enhances balance, eye stability, and full-body coordination without screen involvement."
  },
  "Color Hunt in Room Game": {
    "filename": "room_color_scan.mp4",
    "video_description": "Animated child is shown looking for brightly colored objects across their room — viewers follow along to spot real-world colors."
  },
  "Glow Dot Grid Jump Exercise": {
    "filename": "glow_dot_grid_saccade.mp4",
    "video_description": "Voice-guided cartoon explains how to place colored paper dots on a wall. Child quickly shifts gaze from dot to dot as a helper calls out colors or directions — builds fast eye movement control (saccades) without screen use."
  },
  "Bouncing Letter Focus Game Exercise": {
    "filename": "letter_focus_bounce.mp4",
    "video_description": "Voice-guided cartoon shows how to play a paper letter toss game — family member tosses foam or paper letters gently around the child, who spots and shouts the letter before catching or pointing — builds focus and visual reaction speed without screens."
  },
  "Floating Cloud Gaze Switch Exercise": {
    "filename": "floating_cloud_gaze_shift.mp4",
    "video_description": "Soft clouds drift near and far on a breezy sky background while the child alternates focus between close and distant puffs of cloud — relaxing and engaging."
  },
  "Rolling Ball Tunnel Vision Game": {
    "filename": "rolling_ball_tunnel.mp4",
    "video_description": "An animated child rolls a soft ball along a garden path while keeping their eyes locked on it without moving their head. Trees and butterflies pass in the background. The child bends and follows the ball smoothly to build tunnel vision and eye-body coordination."
  },
  "Foot Tap Direction Game": {
    "filename": "foot_tap_eye_lead.mp4",
    "video_description": "Cartoon child listens for a parent calling directions (‘left’, ‘right’, ‘behind’) and taps the respective foot while keeping eyes fixed on a toy ahead. Animated sparkles highlight each foot tap, enhancing auditory cue to visual-body connection."
  },
  "Basket Toss Color Match Game": {
    "filename": "basket_color_sort.mp4",
    "video_description": "A cartoon child tosses colorful bean bags into matching baskets across the room while keeping their head steady and moving only their eyes first. Balloons cheer with each correct match — develops spatial eye tracking and memory."
  },
  "Pillow Maze Obstacle Game": {
    "filename": "pillow_maze_navigation.mp4",
    "video_description": "Animated child crawls through a home-made pillow tunnel maze guided only by verbal cues from a sibling. Their eyes shine with joy while peeking out through each gap — trains navigation and vision mapping."
  },
  "Box Peek & Recall Game": {
    "filename": "box_peek_memory.mp4",
    "video_description": "Cartoon child peeks inside a box for 3 seconds, then looks away and recalls 3 colored objects from memory while pointing them out. Thought bubbles animate each item, improving visual memory and blink training."
  },
  "Soap Bubble Pop Walk Game": {
    "filename": "bubble_pop_chase.mp4",
    "video_description": "An animated child joyfully runs across a grassy field popping soap bubbles by watching them closely and tapping mid-air — giggles and music highlight quick visual tracking and depth perception training."
  },
  "Shadow Shape Tracing Game": {
    "filename": "shadow_trace_game.mp4",
    "video_description": "Cartoon child uses chalk or fingers to trace shadows of objects cast by sunlight — shadows of trees, toys, and pets stretch on the floor. The scene sparkles as tracing encourages light awareness and visual-motor engagement."
  },
  "Toy Toss and Spot Game": {
    "filename": "toy_toss_spot_game.mp4",
    "video_description": "Parent gently tosses a toy behind or to the side of an animated child. The child quickly turns eyes only to spot where it landed, without head turn first. A playful sparkle rewards correct gaze direction — boosts peripheral vision."
  },
  "Animal Track and Freeze Game": {
    "filename": "animal_track_freeze.mp4",
    "video_description": "A child pretends to be a jungle explorer outdoors. When parent shouts an animal (‘lion’, ‘parrot’), child stops and tracks that direction with eyes only, then freezes. Jungle sounds and wildlife appear in animation — training reflex and direction sense."
  }
}